app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 5]]
---
  def index
    if params[:artist_id]
      @artist = Artist.find(params[:artist_id])
      if @artist.nil?
        redirect_to artists_path, alert: "Artist not found."
      else
        @songs = @artist.songs
      end
    else
      @songs = Song.all

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT ?  [["artist_id", 5], ["id", 12345], ["LIMIT", 1]]
---
  def show
    if params[:artist_id]
      @artist = Artist.find(params[:artist_id])
      if @artist.nil?
        redirect_to artists_songs_path, alert: "Song not found."
      else
        @song = @artist.song.find(params[:id])