app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      @songs = Artist.find(params[:artist_id]).songs
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]